holographicSol/SatIO_ESP32-P4/SatIO/src/task_handler.cpp
    // satellit count
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, gnggaData.satellite_count);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0B); // command 11
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // GPS precision
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, gnggaData.gps_precision_factor);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0C); // command 12
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // time HHMMSS
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_local_time_HHMMSS);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0D); // command 13
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // date DDMMYY
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_local_short_date_DDMMYY);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0E); // command 14
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0);
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 2, iic_delay, "drawSSD1306Canvas");

    /** ----------------------------------------------------------------------------
      DISPLAY 1: ANGLE
    */

    // gyro angle x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x15); // command 21
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // gyro angle y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x16); // command 22
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // gyro angle z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x17); // command 23
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 1);
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 2, iic_delay, "drawSSD1306Canvas");

    /** ----------------------------------------------------------------------------
      DISPLAY 2: ACCELERATION
    */

    // accel x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x1F); // command 31
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

