holographicSol/SatIO_ESP32-P4/SatIO/src/task_handler.cpp
    // accel y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x20); // command 32
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // accel z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x21); // command 33
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 2);
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 2, iic_delay, "drawSSD1306Canvas");

    /** ----------------------------------------------------------------------------
      DISPLAY 3: MAGNETIC FIELD
    */

    // mag x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x29); // command 41
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // mag y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x2A); // command 42
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // mag z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x2B); // command 43
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 1+strlen(temp_buffer_multidisplay), iic_delay, "updateSSD1306");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 3);
    writeI2CToSlaveBin(iic_0, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 2, iic_delay, "drawSSD1306Canvas");

    /** ----------------------------------------------------------------------------
     * Display 4: Fast input (analog/digital multiplexer)
    */
   
    // multiplexer channel 0

    // ------------------------------------------------
    // Counters
    // ------------------------------------------------
    systemData.i_count_display++;
    if (systemData.i_count_display>=UINT32_MAX-2)
      {systemData.i_count_display=0;}
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_DISPLAY==false)
      {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_DISPLAY / portTICK_PERIOD_MS);}
    else {xTaskNotifyWait(0x00, 0x00, NULL, DELAY_TASK_DISPLAY);}
  }
}
void createTaskMultiDisplay() {
    xTaskCreatePinnedToCore(
    tasMultiDisplay,   /* Function to implement the task */
    "TasMultiDisplay", /* Name of the task */
    TASK_DISPLAY_STACK_SIZE, /* Stack size in words */
    NULL,           /* Task input parameter */
    TASK_MULTI_DISPLAY_PRIORITY, /* Priority of the task */
    &TasMultiDisplay,          /* Task handle. */
    TASK_MULTI_DISPLAY_CORE);    /* Core where the task should run */
}

/** ----------------------------------------------------------------------------
 * PowerCfg: Ultimate Performance.
 * 
 * @brief Sets all task delay timings to optimum performance.  
 */
void setTasksDelayUltimatePerformance() {
    // DELAY_TASK_SERIAL_INFOCMD=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_SERIAL_INFOCMD;
    // TICK_DELAY_TASK_SERIAL_INFOCMD=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_SERIAL_INFOCMD;
    // xTaskNotifyGive(TaskSerialInfoCMD);

    DELAY_TASK_MULTIPLEXERS=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_MULTIPLEXERS;
    TICK_DELAY_TASK_MULTIPLEXERS=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_MULTIPLEXERS;
    xTaskNotifyGive(TaskMultiplexers);

    DELAY_TASK_GYRO0=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_GYRO;
    TICK_DELAY_TASK_GYRO0=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_GYRO;
    xTaskNotifyGive(TaskGyro);

    DELAY_TASK_UNIVERSE=POWER_CONFIG_ULTIMATE_PERFORMANCE_DELAY_TASK_UNIVERSE;
    TICK_DELAY_TASK_UNIVERSE=POWER_CONFIG_ULTIMATE_PERFORMANCE_TICK_DELAY_TASK_UNIVERSE;
    xTaskNotifyGive(TaskUniverse);

